//Да се напише програма каде од тастатура се внесува одреден износ на пари кој 
//корисник го има на својата трансакциска сметка. Потоа, во нов ред се внесуваат 
//пет други износи оддвоени со празно место. Тие претставуваат некаква трансакција - одреден 
//трошок или добивка на пари. Програмата печати 1 доколку после извршените трансакции 
//корисникот сеуште има пари на својата сметка, а 0 во спротивно.
//input: 25600
//       10000 250 899 10 -45000         
//output: 0
#include<stdio.h>
#include<stdlib.h>
int main()
{
    int transakcija,a,b,c,d,e;
    scanf("%d",&transakcija);
    scanf("%d%d%d%d%d",&a,&b,&c,&d,&e);
    transakcija+=a;
    transakcija+=b;
    transakcija+=c;
    transakcija+=d;
    transakcija+=e;
    printf("%d",transakcija>0);

return 0;
}
