//Од стандарден влез се вчитуваат следните податоци за еден студент на ФИНКИ:
//    индекс (шестцифрен цел број)
//    шест оценки од последниот семестар кој го слушал
//Да се напише програма која што на стандарден излез ќе ги испечати следните информации за студентот: (погледнете во тест примерите за форматот на печатење)
//    просек на студентот
//        просекот да се испечати со точност од 3 децимали
//    година на студии
//        студентите чијшто индекс почнува на 21 се втора година, 20 се трета година, 19 се четврта година итн.
//    дали е награден (1 = награден, 0 = не е награден)
//        Еден студент се наградува доколку има просек еднаков или поголем од 9.5
#include<stdio.h>
int main()
{
    int Student;
    scanf("%d", &Student);
    int ocena1,ocena2,ocena3,ocena4,ocena5,ocena6;
    scanf("%d%d%d%d%d%d",&ocena1,&ocena2,&ocena3,&ocena4,&ocena5,&ocena6);
    printf("Prosek: %.3f\n", (ocena1+ocena2+ocena3+ocena4+ocena5+ocena6)/6.0);
    printf("Student: %d\n",Student);
    printf("%d godina\n", (23-(Student/10000)));
    printf("Nagraden: %d", (((ocena1+ocena2+ocena3+ocena4+ocena5+ocena6)/6.0)>=9.5));
return 0;

}
