/*Од стандарден влез се вчитува број N, а потоа и N цели броеви. 
Да се испечати на екран најголемата разлика помеѓу два последователно внесени броја.
Да се реши без користење на низи!
Објаснување на примерот:
N=5, па се внесуваат 5 броја: 1,3,0,5,2. Разликите се соодветно:
3-1 = 2
0-3 = -3
5-0 = 5
2-5 = -3
Најголема разлика е 5.*/
#include<stdio.h>
int main()
{
    int N,a,temp,b=0;
    scanf("%d\n",&N);
    
    for(int i=0;i<N;i++){
        scanf("%d",&a);
        
        if(i==1){
            b=a-temp;
        }
        else if(i>1){
            if((a-temp)>b){
                b=a-temp;
                          }
        }
        temp=a;
              }
    printf("%d\n",b);
    return 0;
}